tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoiling/0/nut.gas
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "5";
    object      nut.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar>
1875
(
4.57970072e-05
0.000104055692
0.000140550021
0.000161102808
0.00016607229
0.000156791223
0.000134780553
0.000101355879
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 8.4375e-07;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar>
25
(
4.58087818e-05
0.000104136431
0.000140756274
0.000161475379
0.000166643278
0.000157589189
0.000135830072
0.000102673446
...
)
;
    }
    wall1
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    wall2
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
